[CONFIG]
FONT=Arial
CHSET=1
FSIZE=9
TUTORIAL=Robobuilder Tool Manual.pdf

[TEXT]
T1=Robobuilder Download Tool
T2=ComPort
T3=BaudRate
T4=OpenPort
T5=ClosePort
T6=ScanPort
T7=RoboBuilder Homepage
T8=Manual
T9=File Type
T10=Motion File (*.rbm)
T11=Action File (*.rba)
T12=Directory
T13=File
T14=Serial Code
T15=Firmware Version
T16=Download File List
T17=Memory Space
T18=No.
T19=File Name
T20=Delete
T21=Delete All
T22=Download
T23=File
T24=Serial Code
T25=Read
T26=Download Failure
T27=Success
T28=Not Exist
T29=Not Match
T30=Not Enough
T31=Memory
T32=Excess
T33=There is Not Available COM Port
T34=
T35=Controller
T36=Communication
T37=Memory Space
T38=Motion
T39=Action
T40=files
T41=Available Memory
T42=Try to connect...
T43=Try to disconnect...
T44=Checking Version...
T45=Version Check
T46=Serial Code Checking...
T47=Serial Check
T48=Connected successfully
T49=http://www.robobuilder.net/eng/community/board_index.asp?cmd=list
T50=Up
T51=Down
T52=Link
T53=RQ Homepage
T54=http://www.rqworld.com

T60=Remocon
T61=Download Tool
T62=Diagnostic Tool
T63=Zeropoint Tool
T64=Motion Builder
T65=Action Builder
T66=Check wCK(SAM) Connections
T67=Scan and Check wCK(SAM) ID
T68=STOP
T69=Use the serial communication cable and connect RoboBuilder with the PC. Select Com port and click [OpenPort] or just click [ScanPort] button.
T70=Searching for RoboBuilder Controller…
T71=F/W Version
T72=Platform
T73=Send
T74=Serial Code
T75=Please click STEP1 button.
T76=Successful Communication with DINO!
T77=Successful Communication with DOGY!
T78=Please set the robot platform[PF button] to match with your robot’s construction type.
T79=PF1 LED Colors : HUNO(Blue), DINO(Fuchsia), DOGY(Red);
T80=Push PF1 button for more than 3 seconds to change robot platform.
T81=¶Failed to check the firmware version.
T82=There are 
T83=wCK(SAM) modules with no response.
T84=Please check if any of the wCK cables is not connected.
T85=All wCK(SAM) modules are safely connected.
T86=Have your robot stand with a posture as shown beside and click STEP2 button.
T87=Test Completed!
T88= ] : No response
T89= ] : Testing...
T90=Please check if the moving actuator’s ID is 
T91=
T92=If yes, click STEP2 and continue the scan. If no, you used a wrong wCK(SAM) module. Please re-build your robot to match the ID map as shown in the left side. 
T93= ] position = 
T94=No Com Port available.
T95=ClosePort
T96=STEP
T97 = Check wCK(SAM) connection
T98 = Check wCK(SAM) communication...
T99 = Read
T100 = Fail
T101 = Next ID[ 
T102 =  ] Test
T103 = Last ID Testing
T104 = Error Report :
T105 = Solution :
T106 = wCK(SAM) ID changed successfully.
T107 = Zero Position
T108 = Succeed
T109 = Initialize 
T110 = Acceleration recognition range
T111 = Bandwidth
T112 = Standard acceleration value(x,y,z)
T113 = Posture judgement margin(x,y,z)
T114 = Acceleration sensor
T115 = Configuration
T116 = Complete
T117 = In order to configure acceleration value, RBC should be in horizon status as shown in the left figure. If not, please do it again.
T118 = Progressing
T119 = 1.Check Error Report
T120 = 2.Check wCK(SAM)
T121 = 3.Check Assembly Status
T122 = 4.Check RBC(RQC)
T123 = Error Code
T124 = wCK(SAM) IDs for Test
T125 = Current ID
T126 = New ID
T127 = ID Change
T128 = ※ Keybarod control : [ Decrease, ] Increase
T129 = Read Zero Position info
T130 = Initialize Zero Position
T131 = Read Acceleration value
T132 = Set Standard Acceleration value

T151=RoboBuilder Zero Point Tool
T152=Sequence of diagnostic
T153=Baudrate
T154=Open/Close
T155=Scan Port
T156=Use the serial communication cable and connect RoboBuilder with the PC. Select Com port and click [OpenPort] or just click [ScanPort] button.
T157=Zero Point modified. Quit?
T158=Accept
T159=Successful Communication with HUNO!
T160=Searching for RoboBuilder Controller…
T161=[Control Box Firmware 
T162=Get from RBC(RQC)
T163=Set to RBC(RQC)
T164=Default Value
T165=File Read
T166=File Save
T167=Run Zero Point
T168=Zero Point Data
T169=Run Basic Pose
T170=
T171=¶¶Failed to check the platform.
T172=¶Failed to check the firmware version.
T173= ] : No response
T174=No Com Port available.
T175=Run Basic Pose
T176=Capture(239)/Release
T177=Capture(249)
T178=Link
T179=Manual
T180=RoboBuilder Homepage
T181=http://www.robobuilder.net
T182=RQ Homepage
T183=http://www.rqworld.com

T200 = Chapter 1
T201 = Chapter 2
T202 = Chapter 3
T203 = Chapter 4
T204 = Chapter 5
T205 = Chapter 6
T206 = Chapter 7
T207 = Chapter 8
T208 = Chapter 9
T209 = Chapter 10
T210 = Chapter 11
T211 = Chapter 12
T212 =
T213 =
T214 =
T215 =
T216 =
T217 = Chapter 1~2
T218 = Chapter 3~4
T219 = Chapter 5~6
T220 = Chapter 8~9
T221 = Chapter 10~11
T222 = Chapter 1~3
T223 = Chapter 5~7
T224 = Chapter 9~11

EC255 = No Error
EC1   = Write Error of S-EEPROM 
EC1S  = Turn off power and try again after power-on.
EC2   = Checksum is not correct.
EC2S  = Check the data for transmission or PC cable
EC3   = Exceed Motion numbers 
EC4   = Excced Action numbers
EC5   = Robot Platform in not correct.
EC5S  = Check the current platform for motion play.
EC6   = Frame interval is under 20msec
EC6S  = Too many frames to run scences. Check motion data. 
EC7   = Zero position value is out of range.
EC7S  = Zero position value is exceeded. Initialize Zero Position value and try again.
EC8   = Zero Position value Error
EC8S  = Zero position value is exceeded. Initialize Zero Position value and try again.
EC9   = Exceed wCK(SAM) numbers
EC10  = Fail to position control
EC10S = One of wCK(SAM) is failed to move target position. Check the Assembly status, or wCK (SAM) module.
EC11  = Communication Fail
EC11S = One of wCK(SAM) is failed to communicate with others. Check Cables or wCK(SAM) module.
EC12  = Power adapter Removed while Charging
EC12S = Power adapter Removed while Charging. Check Power cable or Adapter cable if power dapter LED is off.